# An Integrated HR Data Warehouse for Employee Retention and Performance Insights

## Group 6

### 1. Data Extraction

In [ ]:
# !pip install --upgrade sqlalchemy==1.4.52

Collecting sqlalchemy==1.4.52
  Downloading SQLAlchemy-1.4.52-cp311-cp311-macosx_10_9_universal2.whl.metadata (10 kB)
Requirement already satisfied: greenlet!=0.4.17 in /Users/wangxd/Desktop/.conda/lib/python3.11/site-packages (from sqlalchemy==1.4.52) (3.1.1)
Downloading SQLAlchemy-1.4.52-cp311-cp311-macosx_10_9_universal2.whl (1.6 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 15.4 MB/s eta 0:00:00
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 2.0.40
    Uninstalling SQLAlchemy-2.0.40:
      Successfully uninstalled SQLAlchemy-2.0.40
Successfully installed sqlalchemy-1.4.52

In [2]:
import pandas as pd
from sqlalchemy import create_engine

In [3]:
df = pd.read_csv('/Users/wangxd/Desktop/M.S. of AA/APAN 5310 SQL/5310_Project/Employee.csv')
df.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 35 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1470 non-null   int64
 1   Attrition                 1470 non-null   object
 2   BusinessTravel            1470 non-null   object
 3   DailyRate                 1470 non-null   int64
 4   Department                1470 non-null   object
 5   DistanceFromHome          1470 non-null   int64
 6   Education                 1470 non-null   int64
 7   EducationField            1470 non-null   object
 8   EmployeeCount             1470 non-null   int64
 9   EmployeeNumber            1470 non-null   int64
 10  EnvironmentSatisfaction   1470 non-null   int64
 11  Gender                    1470 non-null   object
 12  HourlyRate                1470 non-null   int64
 13  JobInvolvement            1470 non-null   int64
 14  JobLevel                  1470 non-null   int64
 15  JobRole                   1470 non-null   object
 16  JobSatisfaction           1470 non-null   int64
 17  MaritalStatus             1470 non-null   object
 18  MonthlyIncome             1470 non-null   int64
 19  MonthlyRate               1470 non-null   int64
 20  NumCompaniesWorked        1470 non-null   int64
 21  Over18                    1470 non-null   object
 22  OverTime                  1470 non-null   object
 23  PercentSalaryHike         1470 non-null   int64
 24  PerformanceRating         1470 non-null   int64
 25  RelationshipSatisfaction  1470 non-null   int64
 26  StandardHours             1470 non-null   int64
 27  StockOptionLevel          1470 non-null   int64
 28  TotalWorkingYears         1470 non-null   int64
 29  TrainingTimesLastYear     1470 non-null   int64
 30  WorkLifeBalance           1470 non-null   int64
 31  YearsAtCompany            1470 non-null   int64
 32  YearsInCurrentRole        1470 non-null   int64
 33  YearsSinceLastPromotion   1470 non-null   int64
 34  YearsWithCurrManager      1470 non-null   int64
dtypes: int64(26), object(9)
memory usage: 402.1+ KB

### Create database tables

In [38]:
conn_url = 'postgresql://postgres:123@localhost:5432/53_Project'


engine = create_engine(conn_url)

connection = engine.connect()

In [6]:
stmt = """
DROP TABLE IF EXISTS salary_components;
DROP TABLE IF EXISTS attrition_status;
DROP TABLE IF EXISTS employee_asset;
DROP TABLE IF EXISTS work_schedule;
DROP TABLE IF EXISTS work_experience;
DROP TABLE IF EXISTS satisfaction;
DROP TABLE IF EXISTS performance;
DROP TABLE IF EXISTS income;
DROP TABLE IF EXISTS education;
DROP TABLE IF EXISTS work_assignments;
DROP TABLE IF EXISTS employees;
DROP TABLE IF EXISTS departments;
DROP TABLE IF EXISTS job_roles;
DROP TABLE IF EXISTS education_fields;

CREATE TABLE departments (
    department_id INT PRIMARY KEY,
    department_name VARCHAR(50) NOT NULL UNIQUE
);

CREATE TABLE job_roles (
    job_role_id INT PRIMARY KEY,
    job_role_name VARCHAR(100) NOT NULL UNIQUE
);

CREATE TABLE education_fields (
    education_field_id INT PRIMARY KEY,
    education_field_name VARCHAR(100) NOT NULL UNIQUE
);

CREATE TABLE employees (
    employee_number INT PRIMARY KEY,
    age INT NOT NULL CHECK (age >= 18),
    gender VARCHAR(10) NOT NULL CHECK (gender IN ('Male', 'Female', 'Other')),
    marital_status VARCHAR(20),
    department_id INT NOT NULL,
    FOREIGN KEY (department_id) REFERENCES departments(department_id)
);

CREATE TABLE work_assignments (
    employee_number INT PRIMARY KEY,
    job_role_id INT NOT NULL,
    business_travel VARCHAR(50),
    job_level INT,
    FOREIGN KEY (employee_number) REFERENCES employees(employee_number) ON DELETE CASCADE,
    FOREIGN KEY (job_role_id) REFERENCES job_roles(job_role_id)
);

CREATE TABLE education (
    employee_number INT PRIMARY KEY,
    education_level INT NOT NULL,
    education_field_id INT NOT NULL,
    FOREIGN KEY (employee_number) REFERENCES employees(employee_number) ON DELETE CASCADE,
    FOREIGN KEY (education_field_id) REFERENCES education_fields(education_field_id)
);

CREATE TABLE salary_components (
    employee_number INT PRIMARY KEY,
    daily_rate FLOAT,
    hourly_rate FLOAT,
    monthly_rate FLOAT NOT NULL,
    FOREIGN KEY (employee_number) REFERENCES employees(employee_number) ON DELETE CASCADE
);

CREATE TABLE income (
    employee_number INT PRIMARY KEY,
    monthly_income FLOAT,
    percent_salary_hike INT,
    FOREIGN KEY (employee_number) REFERENCES employees(employee_number) ON DELETE CASCADE
);

CREATE TABLE performance (
    employee_number INT PRIMARY KEY,
    performance_rating INT,
    training_times_last_year INT,
    FOREIGN KEY (employee_number) REFERENCES employees(employee_number) ON DELETE CASCADE
);

CREATE TABLE satisfaction (
    employee_number INT PRIMARY KEY,
    environment_satisfaction INT,
    job_satisfaction INT,
    relationship_satisfaction INT,
    work_life_balance INT,
    FOREIGN KEY (employee_number) REFERENCES employees(employee_number) ON DELETE CASCADE
);

CREATE TABLE work_experience (
    employee_number INT PRIMARY KEY,
    num_companies_worked INT,
    total_working_years INT,
    years_at_company INT,
    years_in_current_role INT,
    years_since_last_promotion INT,
    years_with_curr_manager INT,
    FOREIGN KEY (employee_number) REFERENCES employees(employee_number) ON DELETE CASCADE
);

CREATE TABLE work_schedule (
    employee_number INT PRIMARY KEY,
    overtime VARCHAR(5),
    distance_from_home INT,
    FOREIGN KEY (employee_number) REFERENCES employees(employee_number) ON DELETE CASCADE
);

CREATE TABLE employee_asset (
    employee_number INT PRIMARY KEY,
    stock_option_level INT,
    FOREIGN KEY (employee_number) REFERENCES employees(employee_number) ON DELETE CASCADE
);

CREATE TABLE attrition_status (
    employee_number INT PRIMARY KEY,
    attrition VARCHAR(10) NOT NULL CHECK (attrition IN ('Yes', 'No')),
    FOREIGN KEY (employee_number) REFERENCES employees(employee_number) ON DELETE CASCADE
);

"""

connection.execute(stmt)

/var/folders/hn/ppjqqvp92p98s_jyr599kvk40000gn/T/ipykernel_13962/2324253777.py:121: RemovedIn20Warning: Deprecated API features detected! These feature(s) are not compatible with SQLAlchemy 2.0. To prevent incompatible upgrades prior to updating applications, ensure requirements files are pinned to "sqlalchemy<2.0". Set environment variable SQLALCHEMY_WARN_20=1 to show all deprecation warnings.  Set environment variable SQLALCHEMY_SILENCE_UBER_WARNING=1 to silence this message. (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  connection.execute(stmt)

### 2. Transform and Loading

#### 2.1 Department

In [39]:
unique_departments = df['Department'].dropna().unique()
departments_df = pd.DataFrame({
    'department_id': range(1, len(unique_departments) + 1),
    'department_name': unique_departments
})

departments_df

   department_id         department_name
0              1                   Sales
1              2  Research & Development
2              3         Human Resources

In [40]:
departments_df.to_sql(
    name='departments',
    con=engine,
    if_exists='append',
    index=False
)
print("Departments table inserted successfully.")

Departments table inserted successfully.

#### 2.2 job_roles

In [41]:
unique_job_roles = df['JobRole'].dropna().unique()

job_roles_df = pd.DataFrame({
    'job_role_id': range(1, len(unique_job_roles) + 1),
    'job_role_name': unique_job_roles
})
job_roles_df

   job_role_id              job_role_name
0            1            Sales Executive
1            2         Research Scientist
2            3      Laboratory Technician
3            4     Manufacturing Director
4            5  Healthcare Representative
5            6                    Manager
6            7       Sales Representative
7            8          Research Director
8            9            Human Resources

In [42]:
job_roles_df.to_sql(
    name='job_roles',
    con=engine,
    if_exists='append',
    index=False
)

9

#### 2.3 education_fields

In [43]:
unique_edu_fields = df['EducationField'].dropna().unique()

education_fields_df = pd.DataFrame({
    'education_field_id': range(1, len(unique_edu_fields) + 1),
    'education_field_name': unique_edu_fields
})
education_fields_df

   education_field_id education_field_name
0                   1        Life Sciences
1                   2                Other
2                   3              Medical
3                   4            Marketing
4                   5     Technical Degree
5                   6      Human Resources

In [44]:
education_fields_df.to_sql(
    name='education_fields',
    con=engine,
    if_exists='append',
    index=False
)

6

In [1]:
!pip list | grep psycopg

psycopg                   3.2.6
psycopg-binary            3.2.6
psycopg2-binary           2.9.10

#### 2.4 employees

In [45]:
employees_df = df[['EmployeeNumber', 'Age', 'Gender', 'MaritalStatus', 'Department']].copy()
employees_df = employees_df.merge(departments_df, how='left', left_on='Department', right_on='department_name')
employees_df = employees_df.rename(columns={
    'EmployeeNumber': 'employee_number',
    'Age': 'age',
    'Gender': 'gender',
    'MaritalStatus': 'marital_status',
    'department_id': 'department_id'
})[['employee_number', 'age', 'gender', 'marital_status', 'department_id']]

employees_df

      employee_number  age  gender marital_status  department_id
0                   1   41  Female         Single              1
1                   2   49    Male        Married              2
2                   4   37    Male         Single              2
3                   5   33  Female        Married              2
4                   7   27    Male        Married              2
...               ...  ...     ...            ...            ...
1465             2061   36    Male        Married              2
1466             2062   39    Male        Married              2
1467             2064   27    Male        Married              2
1468             2065   49    Male        Married              1
1469             2068   34    Male        Married              2

[1470 rows x 5 columns]

In [46]:
employees_df.to_sql(
    name='employees',
    con=engine,
    if_exists='append',
    index=False
)

470

#### 2.5 work_assignments

In [47]:
# We have to map job name to job id here
job_roles_df = pd.read_sql('SELECT * FROM job_roles', con=engine)
jobrole_mapping = dict(zip(job_roles_df['job_role_name'], job_roles_df['job_role_id']))


workassignments_df = df[['EmployeeNumber', 'JobRole', 'BusinessTravel', 'JobLevel']].copy()
workassignments_df['job_role_id'] = workassignments_df['JobRole'].map(jobrole_mapping)

# final table
workassignments_df = workassignments_df[['EmployeeNumber', 'job_role_id', 'BusinessTravel', 'JobLevel']].rename(
    columns={
    'EmployeeNumber': 'employee_number',
    'BusinessTravel': 'business_travel',
    'JobLevel': 'job_level'
    })
workassignments_df

      employee_number  job_role_id    business_travel  job_level
0                   1            1      Travel_Rarely          2
1                   2            2  Travel_Frequently          2
2                   4            3      Travel_Rarely          1
3                   5            2  Travel_Frequently          1
4                   7            3      Travel_Rarely          1
...               ...          ...                ...        ...
1465             2061            3  Travel_Frequently          2
1466             2062            5      Travel_Rarely          3
1467             2064            4      Travel_Rarely          2
1468             2065            1  Travel_Frequently          2
1469             2068            3      Travel_Rarely          2

[1470 rows x 4 columns]

In [48]:
workassignments_df.to_sql(
    name='work_assignments',
    con=engine,
    if_exists='append',
    index=False
)

470

#### 2.6 education

In [49]:
education_fields_df = pd.read_sql('SELECT * FROM education_fields', con=engine)

educationfield_mapping = dict(zip(education_fields_df['education_field_name'], education_fields_df['education_field_id']))



education_df = df[['EmployeeNumber', 'Education', 'EducationField']].copy()

education_df['education_field_id'] = education_df['EducationField'].map(educationfield_mapping)


education_df = education_df[['EmployeeNumber', 'Education', 'education_field_id']].rename(
    columns={'EmployeeNumber': 'employee_number','Education': 'education_level'})


education_df

      employee_number  education_level  education_field_id
0                   1                2                   1
1                   2                1                   1
2                   4                2                   2
3                   5                4                   1
4                   7                1                   3
...               ...              ...                 ...
1465             2061                2                   3
1466             2062                1                   3
1467             2064                3                   1
1468             2065                3                   3
1469             2068                3                   3

[1470 rows x 3 columns]

In [50]:
education_df.to_sql(
    name='education',
    con=engine,
    if_exists='append',
    index=False
)

470

#### 2.7 salary_components

In [51]:
salary_components_df = df[['EmployeeNumber', 'DailyRate', 'HourlyRate', 'MonthlyRate']].copy()


salary_components_df = salary_components_df.rename(columns={
    'EmployeeNumber': 'employee_number',
    'DailyRate': 'daily_rate',
    'HourlyRate': 'hourly_rate',
    'MonthlyRate': 'monthly_rate'
})
salary_components_df

      employee_number  daily_rate  hourly_rate  monthly_rate
0                   1        1102           94         19479
1                   2         279           61         24907
2                   4        1373           92          2396
3                   5        1392           56         23159
4                   7         591           40         16632
...               ...         ...          ...           ...
1465             2061         884           41         12290
1466             2062         613           42         21457
1467             2064         155           87          5174
1468             2065        1023           63         13243
1469             2068         628           82         10228

[1470 rows x 4 columns]

In [52]:
salary_components_df.to_sql(
    name='salary_components',
    con=engine,
    if_exists='append',
    index=False
)

470

#### 2.8 income

In [53]:
income_df = df[['EmployeeNumber', 'MonthlyIncome', 'PercentSalaryHike']].copy()

income_df = income_df.rename(columns={
    'EmployeeNumber': 'employee_number',
    'MonthlyIncome': 'monthly_income',
    'PercentSalaryHike': 'percent_salary_hike'
})
income_df

      employee_number  monthly_income  percent_salary_hike
0                   1            5993                   11
1                   2            5130                   23
2                   4            2090                   15
3                   5            2909                   11
4                   7            3468                   12
...               ...             ...                  ...
1465             2061            2571                   17
1466             2062            9991                   15
1467             2064            6142                   20
1468             2065            5390                   14
1469             2068            4404                   12

[1470 rows x 3 columns]

In [54]:
income_df.to_sql(
    name='income',
    con=engine,
    if_exists='append',
    index=False
)

470

#### 2.9 performance

In [55]:
performance_df = df[['EmployeeNumber', 'PerformanceRating', 'TrainingTimesLastYear']].copy()

performance_df = performance_df.rename(columns={
    'EmployeeNumber': 'employee_number',
    'PerformanceRating': 'performance_rating',
    'TrainingTimesLastYear': 'training_times_last_year'
})

performance_df

      employee_number  performance_rating  training_times_last_year
0                   1                   3                         0
1                   2                   4                         3
2                   4                   3                         3
3                   5                   3                         3
4                   7                   3                         3
...               ...                 ...                       ...
1465             2061                   3                         3
1466             2062                   3                         5
1467             2064                   4                         0
1468             2065                   3                         3
1469             2068                   3                         3

[1470 rows x 3 columns]

In [56]:
performance_df.to_sql(
    name='performance',
    con=engine,
    if_exists='append',
    index=False
)

470

#### 2.10 satisfaction

In [57]:
satisfaction_df = df[['EmployeeNumber', 'EnvironmentSatisfaction', 'JobSatisfaction',
                      'RelationshipSatisfaction', 'WorkLifeBalance']].copy()

satisfaction_df = satisfaction_df.rename(columns={
    'EmployeeNumber': 'employee_number',
    'EnvironmentSatisfaction': 'environment_satisfaction',
    'JobSatisfaction': 'job_satisfaction',
    'RelationshipSatisfaction': 'relationship_satisfaction',
    'WorkLifeBalance': 'work_life_balance'
})

satisfaction_df

,employee_number,environment_satisfaction,job_satisfaction,relationship_satisfaction,work_life_balance
0,1,2,4,1,1
1,2,3,2,4,3
2,4,4,3,2,3
3,5,4,3,3,3
4,7,1,2,4,3
...,...,...,...,...,...
1465,2061,3,4,3,3
1466,2062,4,1,1,3
1467,2064,2,2,2,3
1468,2065,4,2,4,2
1469,2068,2,3,1,4

In [58]:
satisfaction_df.to_sql(
    name='satisfaction',
    con=engine,
    if_exists='append',
    index=False
)

470

#### 2.11 work_experience

In [59]:
work_experience_df = df[['EmployeeNumber', 'NumCompaniesWorked', 'TotalWorkingYears',
                         'YearsAtCompany', 'YearsInCurrentRole',
                         'YearsSinceLastPromotion', 
                         'YearsWithCurrManager']].copy()


work_experience_df = work_experience_df.rename(columns={
    'EmployeeNumber': 'employee_number',
    'NumCompaniesWorked': 'num_companies_worked',
    'TotalWorkingYears': 'total_working_years',
    'YearsAtCompany': 'years_at_company',
    'YearsInCurrentRole': 'years_in_current_role',
    'YearsSinceLastPromotion': 'years_since_last_promotion',
    'YearsWithCurrManager': 'years_with_curr_manager'
})

work_experience_df

,employee_number,num_companies_worked,total_working_years,years_at_company,years_in_current_role,years_since_last_promotion,years_with_curr_manager
0,1,8,8,6,4,0,5
1,2,1,10,10,7,1,7
2,4,6,7,0,0,0,0
3,5,1,8,8,7,3,0
4,7,9,6,2,2,2,2
...,...,...,...,...,...,...,...
1465,2061,4,17,5,2,0,3
1466,2062,4,9,7,7,1,7
1467,2064,1,6,6,2,0,3
1468,2065,2,17,9,6,0,8
1469,2068,2,6,4,3,1,2

In [60]:
work_experience_df.to_sql(
    name='work_experience',
    con=engine,
    if_exists='append',
    index=False
)

470

#### 2.12 work_schedule

In [61]:
work_schedule_df = df[['EmployeeNumber', 'OverTime', 'DistanceFromHome']].copy()

work_schedule_df = work_schedule_df.rename(columns={
    'EmployeeNumber': 'employee_number',
    'OverTime': 'overtime',
    'DistanceFromHome': 'distance_from_home'
})
work_schedule_df

      employee_number overtime  distance_from_home
0                   1      Yes                   1
1                   2       No                   8
2                   4      Yes                   2
3                   5      Yes                   3
4                   7       No                   2
...               ...      ...                 ...
1465             2061       No                  23
1466             2062       No                   6
1467             2064      Yes                   4
1468             2065       No                   2
1469             2068       No                   8

[1470 rows x 3 columns]

In [62]:
work_schedule_df.to_sql(
    name='work_schedule',
    con=engine,
    if_exists='append',
    index=False
)

470

#### 2.13 employee_asset

In [63]:
employee_asset_df = df[['EmployeeNumber', 'StockOptionLevel']].copy()

employee_asset_df = employee_asset_df.rename(columns={
    'EmployeeNumber': 'employee_number',
    'StockOptionLevel': 'stock_option_level'
})

employee_asset_df

      employee_number  stock_option_level
0                   1                   0
1                   2                   1
2                   4                   0
3                   5                   0
4                   7                   1
...               ...                 ...
1465             2061                   1
1466             2062                   1
1467             2064                   1
1468             2065                   0
1469             2068                   0

[1470 rows x 2 columns]

In [64]:
employee_asset_df.to_sql(
    name='employee_asset',
    con=engine,
    if_exists='append',
    index=False
)

470

#### 2.14 attrition_status

In [65]:
attrition_status_df = df[['EmployeeNumber', 'Attrition']].copy()

attrition_status_df = attrition_status_df.rename(columns={
    'EmployeeNumber': 'employee_number',
    'Attrition': 'attrition'
})

attrition_status_df

      employee_number attrition
0                   1       Yes
1                   2        No
2                   4       Yes
3                   5        No
4                   7        No
...               ...       ...
1465             2061        No
1466             2062        No
1467             2064        No
1468             2065        No
1469             2068        No

[1470 rows x 2 columns]

In [66]:
attrition_status_df.to_sql(
    name='attrition_status',
    con=engine,
    if_exists='append',
    index=False
)

470

### 3. Spot Checks & Validation

#### 3.1 Check records in each tables

In [84]:
stmt = """
    SELECT 'departments' AS table_name, COUNT(*) AS row_count FROM departments
    UNION ALL SELECT 'job_roles', COUNT(*) FROM job_roles
    UNION ALL SELECT 'education_fields', COUNT(*) FROM education_fields
    UNION ALL SELECT 'employees', COUNT(*) FROM employees
    UNION ALL SELECT 'work_assignments', COUNT(*) FROM work_assignments
    UNION ALL SELECT 'education', COUNT(*) FROM education
    UNION ALL SELECT 'salary_components', COUNT(*) FROM salary_components
    UNION ALL SELECT 'income', COUNT(*) FROM income
    UNION ALL SELECT 'performance', COUNT(*) FROM performance
    UNION ALL SELECT 'satisfaction', COUNT(*) FROM satisfaction
    UNION ALL SELECT 'work_experience', COUNT(*) FROM work_experience
    UNION ALL SELECT 'work_schedule', COUNT(*) FROM work_schedule
    UNION ALL SELECT 'employee_asset', COUNT(*) FROM employee_asset
    UNION ALL SELECT 'attrition_status', COUNT(*) FROM attrition_status
"""

results = connection.execute(stmt).fetchall()
table_counts_df = pd.DataFrame(results, columns=results[0].keys())

table_counts_df

           table_name  row_count
0         departments          3
1           job_roles          9
2    education_fields          6
3           employees       1470
4    work_assignments       1470
5           education       1470
6   salary_components       1470
7              income       1470
8         performance       1470
9        satisfaction       1470
10    work_experience       1470
11      work_schedule       1470
12     employee_asset       1470
13   attrition_status       1470

##### Since we already set the NOT NULL constraint well, we will not check for null values.

#### 3.2 Check for duplicate primary keys

In [87]:

#This is an example
stmt = """
    SELECT employee_number, COUNT(*) AS count
    FROM employees
    GROUP BY employee_number
    HAVING COUNT(*) > 1
"""

results = connection.execute(stmt).fetchall()
duplicate = pd.DataFrame(results, columns=results[0].keys()) if results else pd.DataFrame(columns=['employee_number', 'count'])
duplicate

# If it is good, it should return none

Empty DataFrame
Columns: [employee_number, count]
Index: []

#### 3.3 Check mapping

In [92]:
stmt = """
    SELECT e.employee_number 
    FROM education e 
    LEFT JOIN employees emp ON e.employee_number = emp.employee_number 
    WHERE emp.employee_number IS NULL
"""

results = connection.execute(stmt).fetchall()
edu_check= pd.DataFrame(results, columns=results[0].keys()) if results else pd.DataFrame(columns=['employee_number'])
edu_check

Empty DataFrame
Columns: [employee_number]
Index: []

#### 3.4 Check whether job_role_id/department_id is referenced correctly

In [90]:
stmt = """
    SELECT DISTINCT job_role_id 
    FROM workassignments
    WHERE job_role_id NOT IN (SELECT job_role_id FROM job_roles)
"""

results = connection.execute(stmt).fetchall()
jobrole_refs = pd.DataFrame(results, columns=results[0].keys()) if results else pd.DataFrame(columns=['job_role_id'])
jobrole_refs

Empty DataFrame
Columns: [job_role_id]
Index: []

In [91]:
stmt = """
    SELECT DISTINCT department_id 
    FROM employees
    WHERE department_id NOT IN (SELECT department_id FROM departments)
"""

results = connection.execute(stmt).fetchall()
dept_refs = pd.DataFrame(results, columns=results[0].keys()) if results else pd.DataFrame(columns=['department_id'])
dept_refs

Empty DataFrame
Columns: [department_id]
Index: []

In [ ]:
import sys

print(sys.version)

3.11.7 (main, Dec 15 2023, 12:09:04) [Clang 14.0.6 ]

### 4. Business Demand Queries